#--------------------------------------#----------------------------------------#
#           A indentação é importante , pois senão ele irá printar errado       #
#--------------------------------------#----------------------------------------#

for x in range (2) :
    print("*")
    for x in range (1) :
        print("* *")
        for x in range (1) :
            print("* * *")
            for x in range (1) :
                print("* *")
                for x in range (1) :
                    print("*")

#--------------------------------------#----------------------------------------#
#           If it wasn't indented , it would print "*" out of order             #
#--------------------------------------#----------------------------------------#
#               Se não estivesse indentado , os "*" estarão errados             #
#--------------------------------------#----------------------------------------#       